var name = prompt('Введите своё имя');
console.log('Меня зовут ' + name);

var year = +prompt('Введите свой возрост');
console.log('Мне ' + year);

var pr1 = +prompt('Решите пример 5 + 3 = ?');
console.log('Пример 1: 5 + 3 = ' + (5 + 3) + ' Ваш ответ ' + pr1);

var pr2 = +prompt('Решите пример 17 - 5 = ?');
console.log('Пример 2: 17 - 5 = ' + (17 - 5) + ' Ваш ответ ' + pr2);

var pr3 = +prompt('Решите пример 12 * 2 = ?');
console.log('Пример 2: 12 * 2 = ' + (12 * 2) + ' Ваш ответ ' + pr3);

var pr4 = +prompt('Решите пример 8 / 4 = ?');
console.log('Пример 2: 8 / 4 = ' + (8 / 4) + ' Ваш ответ ' + pr4);

var pr5 = +prompt('Решите пример 10 % 3 = ?');
console.log('Пример 2: 10 % 3 = ' + (10 % 3) + ' Ваш ответ ' + pr5);

alert('Откройте консоль для просмотра')